trade_exp/src/Catalogs/ВидыТранспортныхСредств/ВидыТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="27f764fd-dc78-494b-a848-4ffca26f3088">
  <name>ВидыТранспортныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d3ca433c-9966-4393-bbb8-31c52f98f863">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9b0af041-f07f-4637-8113-bb596c81a2c1">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="21f8ae72-92b0-44ee-b117-390c362bf625">
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ВидыТранспортныхСредств/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		
		Если ЗначениеЗаполнено(Вес) Тогда
			Наименование = ?(Вес % 1000 = 0, ("До " + Вес/1000 + "т"), ("До " + Вес + "кг"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Длина) Тогда
			Наименование = Наименование + ?(ЗначениеЗаполнено(Наименование), ", до ", "До ") + Длина + "м";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объем) Тогда
			Наименование = Наименование + ?(ЗначениеЗаполнено(Наименование), ", до ", "До ") + Объем + "м3";
		КонецЕсли;

	КонецЕсли;
	
	//Наименование = "До " + ?(Вес % 1000 = 0, ("" + Вес/1000 + "т, "), ("" + Вес + "кг, ")) + "до " + Длина + "м, до " + Объем + "м3";
КонецПроцедуры
